Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_fail_safe_bootloader/bootloader/firmware/src/packs/PIC32CX2051MTSH128_DFP/component/sfr.h
/*
 * Component description for SFR
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description file (ATDF) version 2023-12-19T08:59:38Z */
#ifndef _PIC32CXMTSH_SFR_COMPONENT_H_
#define _PIC32CXMTSH_SFR_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR SFR                                          */
/* ************************************************************************** */

/* -------- SFR_SRAM0_SW_CFG : (SFR Offset: 0x10) (R/W 32) SRAM0 Software Config Register -------- */
#define SFR_SRAM0_SW_CFG_M128LS_Pos           _UINT32_(0)                                          /* (SFR_SRAM0_SW_CFG) 128 KB Light Sleep Mode Position */
#define SFR_SRAM0_SW_CFG_M128LS_Msk           (_UINT32_(0x1) << SFR_SRAM0_SW_CFG_M128LS_Pos)       /* (SFR_SRAM0_SW_CFG) 128 KB Light Sleep Mode Mask */
#define SFR_SRAM0_SW_CFG_M128LS(value)        (SFR_SRAM0_SW_CFG_M128LS_Msk & (_UINT32_(value) << SFR_SRAM0_SW_CFG_M128LS_Pos)) /* Assigment of value for M128LS in the SFR_SRAM0_SW_CFG register */
#define SFR_SRAM0_SW_CFG_M128DS_Pos           _UINT32_(1)                                          /* (SFR_SRAM0_SW_CFG) 128 KB Deep Sleep Mode Position */
#define SFR_SRAM0_SW_CFG_M128DS_Msk           (_UINT32_(0x1) << SFR_SRAM0_SW_CFG_M128DS_Pos)       /* (SFR_SRAM0_SW_CFG) 128 KB Deep Sleep Mode Mask */
#define SFR_SRAM0_SW_CFG_M128DS(value)        (SFR_SRAM0_SW_CFG_M128DS_Msk & (_UINT32_(value) << SFR_SRAM0_SW_CFG_M128DS_Pos)) /* Assigment of value for M128DS in the SFR_SRAM0_SW_CFG register */
#define SFR_SRAM0_SW_CFG_M128SD_Pos           _UINT32_(2)                                          /* (SFR_SRAM0_SW_CFG) 128 KB Shutdown Mode Position */
#define SFR_SRAM0_SW_CFG_M128SD_Msk           (_UINT32_(0x1) << SFR_SRAM0_SW_CFG_M128SD_Pos)       /* (SFR_SRAM0_SW_CFG) 128 KB Shutdown Mode Mask */
#define SFR_SRAM0_SW_CFG_M128SD(value)        (SFR_SRAM0_SW_CFG_M128SD_Msk & (_UINT32_(value) << SFR_SRAM0_SW_CFG_M128SD_Pos)) /* Assigment of value for M128SD in the SFR_SRAM0_SW_CFG register */
#define SFR_SRAM0_SW_CFG_M256LS_Pos           _UINT32_(4)                                          /* (SFR_SRAM0_SW_CFG) 256 KB Light Sleep Mode Position */
#define SFR_SRAM0_SW_CFG_M256LS_Msk           (_UINT32_(0x1) << SFR_SRAM0_SW_CFG_M256LS_Pos)       /* (SFR_SRAM0_SW_CFG) 256 KB Light Sleep Mode Mask */
#define SFR_SRAM0_SW_CFG_M256LS(value)        (SFR_SRAM0_SW_CFG_M256LS_Msk & (_UINT32_(value) << SFR_SRAM0_SW_CFG_M256LS_Pos)) /* Assigment of value for M256LS in the SFR_SRAM0_SW_CFG register */
#define SFR_SRAM0_SW_CFG_M256DS_Pos           _UINT32_(5)                                          /* (SFR_SRAM0_SW_CFG) 256 KB Deep Sleep Mode Position */
#define SFR_SRAM0_SW_CFG_M256DS_Msk           (_UINT32_(0x1) << SFR_SRAM0_SW_CFG_M256DS_Pos)       /* (SFR_SRAM0_SW_CFG) 256 KB Deep Sleep Mode Mask */
#define SFR_SRAM0_SW_CFG_M256DS(value)        (SFR_SRAM0_SW_CFG_M256DS_Msk & (_UINT32_(value) << SFR_SRAM0_SW_CFG_M256DS_Pos)) /* Assigment of value for M256DS in the SFR_SRAM0_SW_CFG register */
#define SFR_SRAM0_SW_CFG_M256SD_Pos           _UINT32_(6)                                          /* (SFR_SRAM0_SW_CFG) 256 KB Shutdown Mode Position */
#define SFR_SRAM0_SW_CFG_M256SD_Msk           (_UINT32_(0x1) << SFR_SRAM0_SW_CFG_M256SD_Pos)       /* (SFR_SRAM0_SW_CFG) 256 KB Shutdown Mode Mask */
#define SFR_SRAM0_SW_CFG_M256SD(value)        (SFR_SRAM0_SW_CFG_M256SD_Msk & (_UINT32_(value) << SFR_SRAM0_SW_CFG_M256SD_Pos)) /* Assigment of value for M256SD in the SFR_SRAM0_SW_CFG register */
#define SFR_SRAM0_SW_CFG_M384LS_Pos           _UINT32_(8)                                          /* (SFR_SRAM0_SW_CFG) 384 KB Light Sleep Mode Position */
#define SFR_SRAM0_SW_CFG_M384LS_Msk           (_UINT32_(0x1) << SFR_SRAM0_SW_CFG_M384LS_Pos)       /* (SFR_SRAM0_SW_CFG) 384 KB Light Sleep Mode Mask */
#define SFR_SRAM0_SW_CFG_M384LS(value)        (SFR_SRAM0_SW_CFG_M384LS_Msk & (_UINT32_(value) << SFR_SRAM0_SW_CFG_M384LS_Pos)) /* Assigment of value for M384LS in the SFR_SRAM0_SW_CFG register */
#define SFR_SRAM0_SW_CFG_M384DS_Pos           _UINT32_(9)                                          /* (SFR_SRAM0_SW_CFG) 384 KB Deep Sleep Mode Position */
#define SFR_SRAM0_SW_CFG_M384DS_Msk           (_UINT32_(0x1) << SFR_SRAM0_SW_CFG_M384DS_Pos)       /* (SFR_SRAM0_SW_CFG) 384 KB Deep Sleep Mode Mask */
#define SFR_SRAM0_SW_CFG_M384DS(value)        (SFR_SRAM0_SW_CFG_M384DS_Msk & (_UINT32_(value) << SFR_SRAM0_SW_CFG_M384DS_Pos)) /* Assigment of value for M384DS in the SFR_SRAM0_SW_CFG register */
#define SFR_SRAM0_SW_CFG_M384SD_Pos           _UINT32_(10)                                         /* (SFR_SRAM0_SW_CFG) 384 KB Shutdown Mode Position */
#define SFR_SRAM0_SW_CFG_M384SD_Msk           (_UINT32_(0x1) << SFR_SRAM0_SW_CFG_M384SD_Pos)       /* (SFR_SRAM0_SW_CFG) 384 KB Shutdown Mode Mask */
#define SFR_SRAM0_SW_CFG_M384SD(value)        (SFR_SRAM0_SW_CFG_M384SD_Msk & (_UINT32_(value) << SFR_SRAM0_SW_CFG_M384SD_Pos)) /* Assigment of value for M384SD in the SFR_SRAM0_SW_CFG register */
#define SFR_SRAM0_SW_CFG_M512LS_Pos           _UINT32_(12)                                         /* (SFR_SRAM0_SW_CFG) 512 KB Light Sleep Mode Position */
#define SFR_SRAM0_SW_CFG_M512LS_Msk           (_UINT32_(0x1) << SFR_SRAM0_SW_CFG_M512LS_Pos)       /* (SFR_SRAM0_SW_CFG) 512 KB Light Sleep Mode Mask */
#define SFR_SRAM0_SW_CFG_M512LS(value)        (SFR_SRAM0_SW_CFG_M512LS_Msk & (_UINT32_(value) << SFR_SRAM0_SW_CFG_M512LS_Pos)) /* Assigment of value for M512LS in the SFR_SRAM0_SW_CFG register */
#define SFR_SRAM0_SW_CFG_M512DS_Pos           _UINT32_(13)                                         /* (SFR_SRAM0_SW_CFG) 512 KB Deep Sleep Mode Position */
#define SFR_SRAM0_SW_CFG_M512DS_Msk           (_UINT32_(0x1) << SFR_SRAM0_SW_CFG_M512DS_Pos)       /* (SFR_SRAM0_SW_CFG) 512 KB Deep Sleep Mode Mask */
#define SFR_SRAM0_SW_CFG_M512DS(value)        (SFR_SRAM0_SW_CFG_M512DS_Msk & (_UINT32_(value) << SFR_SRAM0_SW_CFG_M512DS_Pos)) /* Assigment of value for M512DS in the SFR_SRAM0_SW_CFG register */
#define SFR_SRAM0_SW_CFG_M512SD_Pos           _UINT32_(14)                                         /* (SFR_SRAM0_SW_CFG) 512 KB Shutdown Mode Position */
#define SFR_SRAM0_SW_CFG_M512SD_Msk           (_UINT32_(0x1) << SFR_SRAM0_SW_CFG_M512SD_Pos)       /* (SFR_SRAM0_SW_CFG) 512 KB Shutdown Mode Mask */
#define SFR_SRAM0_SW_CFG_M512SD(value)        (SFR_SRAM0_SW_CFG_M512SD_Msk & (_UINT32_(value) << SFR_SRAM0_SW_CFG_M512SD_Pos)) /* Assigment of value for M512SD in the SFR_SRAM0_SW_CFG register */
#define SFR_SRAM0_SW_CFG_CLKG_DIS_Pos         _UINT32_(16)                                         /* (SFR_SRAM0_SW_CFG) Clock Gating Disable Position */
#define SFR_SRAM0_SW_CFG_CLKG_DIS_Msk         (_UINT32_(0x1) << SFR_SRAM0_SW_CFG_CLKG_DIS_Pos)     /* (SFR_SRAM0_SW_CFG) Clock Gating Disable Mask */
#define SFR_SRAM0_SW_CFG_CLKG_DIS(value)      (SFR_SRAM0_SW_CFG_CLKG_DIS_Msk & (_UINT32_(value) << SFR_SRAM0_SW_CFG_CLKG_DIS_Pos)) /* Assigment of value for CLKG_DIS in the SFR_SRAM0_SW_CFG register */
#define SFR_SRAM0_SW_CFG_Msk                  _UINT32_(0x00017777)                                 /* (SFR_SRAM0_SW_CFG) Register Mask  */


/* -------- SFR_FLASH : (SFR Offset: 0x70) (R/W 32) Flash Memory Configuration Register -------- */
#define SFR_FLASH_PATCH_BYPASS_Pos            _UINT32_(0)                                          /* (SFR_FLASH)  Position */
#define SFR_FLASH_PATCH_BYPASS_Msk            (_UINT32_(0x1) << SFR_FLASH_PATCH_BYPASS_Pos)        /* (SFR_FLASH)  Mask */
#define SFR_FLASH_PATCH_BYPASS(value)         (SFR_FLASH_PATCH_BYPASS_Msk & (_UINT32_(value) << SFR_FLASH_PATCH_BYPASS_Pos)) /* Assigment of value for PATCH_BYPASS in the SFR_FLASH register */
#define SFR_FLASH_Msk                         _UINT32_(0x00000001)                                 /* (SFR_FLASH) Register Mask  */


/* -------- SFR_OPT_LINK : (SFR Offset: 0x80) (R/W 32) Optical Link Register -------- */
#define SFR_OPT_LINK_CLK_SELECT_Pos           _UINT32_(0)                                          /* (SFR_OPT_LINK) Clock Selection Position */
#define SFR_OPT_LINK_CLK_SELECT_Msk           (_UINT32_(0x1) << SFR_OPT_LINK_CLK_SELECT_Pos)       /* (SFR_OPT_LINK) Clock Selection Mask */
#define SFR_OPT_LINK_CLK_SELECT(value)        (SFR_OPT_LINK_CLK_SELECT_Msk & (_UINT32_(value) << SFR_OPT_LINK_CLK_SELECT_Pos)) /* Assigment of value for CLK_SELECT in the SFR_OPT_LINK register */
#define SFR_OPT_LINK_Msk                      _UINT32_(0x00000001)                                 /* (SFR_OPT_LINK) Register Mask  */


