Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_fail_safe_bootloader/bootloader/firmware/src/packs/PIC32CX2051MTSH128_DFP/component/sfr.h
/* -------- SFR_CORE_DEBUG_CFG : (SFR Offset: 0xA0) (R/W 32) Core Debug Configuration Register -------- */
#define SFR_CORE_DEBUG_CFG_SWV_Pos            _UINT32_(0)                                          /* (SFR_CORE_DEBUG_CFG) SWV Selection Position */
#define SFR_CORE_DEBUG_CFG_SWV_Msk            (_UINT32_(0x1) << SFR_CORE_DEBUG_CFG_SWV_Pos)        /* (SFR_CORE_DEBUG_CFG) SWV Selection Mask */
#define SFR_CORE_DEBUG_CFG_SWV(value)         (SFR_CORE_DEBUG_CFG_SWV_Msk & (_UINT32_(value) << SFR_CORE_DEBUG_CFG_SWV_Pos)) /* Assigment of value for SWV in the SFR_CORE_DEBUG_CFG register */
#define SFR_CORE_DEBUG_CFG_XTRG1_Pos          _UINT32_(1)                                          /* (SFR_CORE_DEBUG_CFG) From Core 1 to Core 0 Cross Triggering Position */
#define SFR_CORE_DEBUG_CFG_XTRG1_Msk          (_UINT32_(0x1) << SFR_CORE_DEBUG_CFG_XTRG1_Pos)      /* (SFR_CORE_DEBUG_CFG) From Core 1 to Core 0 Cross Triggering Mask */
#define SFR_CORE_DEBUG_CFG_XTRG1(value)       (SFR_CORE_DEBUG_CFG_XTRG1_Msk & (_UINT32_(value) << SFR_CORE_DEBUG_CFG_XTRG1_Pos)) /* Assigment of value for XTRG1 in the SFR_CORE_DEBUG_CFG register */
#define SFR_CORE_DEBUG_CFG_XTRG0_Pos          _UINT32_(2)                                          /* (SFR_CORE_DEBUG_CFG) From Core 0 to Core 1 Cross Triggering Position */
#define SFR_CORE_DEBUG_CFG_XTRG0_Msk          (_UINT32_(0x1) << SFR_CORE_DEBUG_CFG_XTRG0_Pos)      /* (SFR_CORE_DEBUG_CFG) From Core 0 to Core 1 Cross Triggering Mask */
#define SFR_CORE_DEBUG_CFG_XTRG0(value)       (SFR_CORE_DEBUG_CFG_XTRG0_Msk & (_UINT32_(value) << SFR_CORE_DEBUG_CFG_XTRG0_Pos)) /* Assigment of value for XTRG0 in the SFR_CORE_DEBUG_CFG register */
#define SFR_CORE_DEBUG_CFG_Msk                _UINT32_(0x00000007)                                 /* (SFR_CORE_DEBUG_CFG) Register Mask  */

#define SFR_CORE_DEBUG_CFG_XTRG_Pos           _UINT32_(1)                                          /* (SFR_CORE_DEBUG_CFG Position) From Core x to Core x Cross Triggering */
#define SFR_CORE_DEBUG_CFG_XTRG_Msk           (_UINT32_(0x3) << SFR_CORE_DEBUG_CFG_XTRG_Pos)       /* (SFR_CORE_DEBUG_CFG Mask) XTRG */
#define SFR_CORE_DEBUG_CFG_XTRG(value)        (SFR_CORE_DEBUG_CFG_XTRG_Msk & (_UINT32_(value) << SFR_CORE_DEBUG_CFG_XTRG_Pos)) 

/* -------- SFR_ERASE_FLASH_SRAM : (SFR Offset: 0xB0) (R/W 32) Erase Flash/SRAM Register -------- */
#define SFR_ERASE_FLASH_SRAM_HW_ERASE_Pos     _UINT32_(0)                                          /* (SFR_ERASE_FLASH_SRAM) PB2/Peripherals or Hardware Erase Signal Assignment Position */
#define SFR_ERASE_FLASH_SRAM_HW_ERASE_Msk     (_UINT32_(0x1) << SFR_ERASE_FLASH_SRAM_HW_ERASE_Pos) /* (SFR_ERASE_FLASH_SRAM) PB2/Peripherals or Hardware Erase Signal Assignment Mask */
#define SFR_ERASE_FLASH_SRAM_HW_ERASE(value)  (SFR_ERASE_FLASH_SRAM_HW_ERASE_Msk & (_UINT32_(value) << SFR_ERASE_FLASH_SRAM_HW_ERASE_Pos)) /* Assigment of value for HW_ERASE in the SFR_ERASE_FLASH_SRAM register */
#define   SFR_ERASE_FLASH_SRAM_HW_ERASE_DISABLE_Val _UINT32_(0x0)                                        /* (SFR_ERASE_FLASH_SRAM) Hardware erase signal disabled. PB2 pin can be used in GPIO or Peripheral IO mode.  */
#define   SFR_ERASE_FLASH_SRAM_HW_ERASE_ENABLE_Val _UINT32_(0x1)                                        /* (SFR_ERASE_FLASH_SRAM) Hardware erase signal enabled. PB2 pin is assigned to Flash erase function.  */
#define SFR_ERASE_FLASH_SRAM_HW_ERASE_DISABLE (SFR_ERASE_FLASH_SRAM_HW_ERASE_DISABLE_Val << SFR_ERASE_FLASH_SRAM_HW_ERASE_Pos) /* (SFR_ERASE_FLASH_SRAM) Hardware erase signal disabled. PB2 pin can be used in GPIO or Peripheral IO mode. Position  */
#define SFR_ERASE_FLASH_SRAM_HW_ERASE_ENABLE  (SFR_ERASE_FLASH_SRAM_HW_ERASE_ENABLE_Val << SFR_ERASE_FLASH_SRAM_HW_ERASE_Pos) /* (SFR_ERASE_FLASH_SRAM) Hardware erase signal enabled. PB2 pin is assigned to Flash erase function. Position  */
#define SFR_ERASE_FLASH_SRAM_SRAM0_Pos        _UINT32_(1)                                          /* (SFR_ERASE_FLASH_SRAM) Erase SRAM0 Content Position */
#define SFR_ERASE_FLASH_SRAM_SRAM0_Msk        (_UINT32_(0x1) << SFR_ERASE_FLASH_SRAM_SRAM0_Pos)    /* (SFR_ERASE_FLASH_SRAM) Erase SRAM0 Content Mask */
#define SFR_ERASE_FLASH_SRAM_SRAM0(value)     (SFR_ERASE_FLASH_SRAM_SRAM0_Msk & (_UINT32_(value) << SFR_ERASE_FLASH_SRAM_SRAM0_Pos)) /* Assigment of value for SRAM0 in the SFR_ERASE_FLASH_SRAM register */
#define   SFR_ERASE_FLASH_SRAM_SRAM0_NOT_DELETED_Val _UINT32_(0x0)                                        /* (SFR_ERASE_FLASH_SRAM) If HW_ERASE = 1, and HW erase signal assertion occurs, SRAM0 content is not deleted.  */
#define   SFR_ERASE_FLASH_SRAM_SRAM0_DELETED_Val _UINT32_(0x1)                                        /* (SFR_ERASE_FLASH_SRAM) If HW_ERASE = 1, and HW erase signal assertion occurs, SRAM0 content is deleted.  */
#define SFR_ERASE_FLASH_SRAM_SRAM0_NOT_DELETED (SFR_ERASE_FLASH_SRAM_SRAM0_NOT_DELETED_Val << SFR_ERASE_FLASH_SRAM_SRAM0_Pos) /* (SFR_ERASE_FLASH_SRAM) If HW_ERASE = 1, and HW erase signal assertion occurs, SRAM0 content is not deleted. Position  */
#define SFR_ERASE_FLASH_SRAM_SRAM0_DELETED    (SFR_ERASE_FLASH_SRAM_SRAM0_DELETED_Val << SFR_ERASE_FLASH_SRAM_SRAM0_Pos) /* (SFR_ERASE_FLASH_SRAM) If HW_ERASE = 1, and HW erase signal assertion occurs, SRAM0 content is deleted. Position  */
#define SFR_ERASE_FLASH_SRAM_Msk              _UINT32_(0x00000003)                                 /* (SFR_ERASE_FLASH_SRAM) Register Mask  */

#define SFR_ERASE_FLASH_SRAM_SRAM_Pos         _UINT32_(1)                                          /* (SFR_ERASE_FLASH_SRAM Position) Erase SRAMx Content */
#define SFR_ERASE_FLASH_SRAM_SRAM_Msk         (_UINT32_(0x1) << SFR_ERASE_FLASH_SRAM_SRAM_Pos)     /* (SFR_ERASE_FLASH_SRAM Mask) SRAM */
#define SFR_ERASE_FLASH_SRAM_SRAM(value)      (SFR_ERASE_FLASH_SRAM_SRAM_Msk & (_UINT32_(value) << SFR_ERASE_FLASH_SRAM_SRAM_Pos)) 

/* -------- SFR_PWM_DEBUG : (SFR Offset: 0xB4) (R/W 32) PWM Debug Register -------- */
#define SFR_PWM_DEBUG_CORE0_Pos               _UINT32_(0)                                          /* (SFR_PWM_DEBUG) Debug Information Propagation Mode Position */
#define SFR_PWM_DEBUG_CORE0_Msk               (_UINT32_(0x1) << SFR_PWM_DEBUG_CORE0_Pos)           /* (SFR_PWM_DEBUG) Debug Information Propagation Mode Mask */
#define SFR_PWM_DEBUG_CORE0(value)            (SFR_PWM_DEBUG_CORE0_Msk & (_UINT32_(value) << SFR_PWM_DEBUG_CORE0_Pos)) /* Assigment of value for CORE0 in the SFR_PWM_DEBUG register */
#define   SFR_PWM_DEBUG_CORE0_NOT_SENT_Val    _UINT32_(0x0)                                        /* (SFR_PWM_DEBUG) Core x does not send the debug signal to the PWM.  */
#define   SFR_PWM_DEBUG_CORE0_SENT_Val        _UINT32_(0x1)                                        /* (SFR_PWM_DEBUG) Core x sends the debug signal to PWM. Refer to "Debug Mode" in the section "Pulse Width Modulation Controller (PWM)" for details on configuring an action when the debug signal is active.  */
#define SFR_PWM_DEBUG_CORE0_NOT_SENT          (SFR_PWM_DEBUG_CORE0_NOT_SENT_Val << SFR_PWM_DEBUG_CORE0_Pos) /* (SFR_PWM_DEBUG) Core x does not send the debug signal to the PWM. Position  */
#define SFR_PWM_DEBUG_CORE0_SENT              (SFR_PWM_DEBUG_CORE0_SENT_Val << SFR_PWM_DEBUG_CORE0_Pos) /* (SFR_PWM_DEBUG) Core x sends the debug signal to PWM. Refer to "Debug Mode" in the section "Pulse Width Modulation Controller (PWM)" for details on configuring an action when the debug signal is active. Position  */
#define SFR_PWM_DEBUG_CORE1_Pos               _UINT32_(1)                                          /* (SFR_PWM_DEBUG) Debug Information Propagation Mode Position */
#define SFR_PWM_DEBUG_CORE1_Msk               (_UINT32_(0x1) << SFR_PWM_DEBUG_CORE1_Pos)           /* (SFR_PWM_DEBUG) Debug Information Propagation Mode Mask */
#define SFR_PWM_DEBUG_CORE1(value)            (SFR_PWM_DEBUG_CORE1_Msk & (_UINT32_(value) << SFR_PWM_DEBUG_CORE1_Pos)) /* Assigment of value for CORE1 in the SFR_PWM_DEBUG register */
#define   SFR_PWM_DEBUG_CORE1_NOT_SENT_Val    _UINT32_(0x0)                                        /* (SFR_PWM_DEBUG) Core x does not send the debug signal to the PWM.  */
#define   SFR_PWM_DEBUG_CORE1_SENT_Val        _UINT32_(0x1)                                        /* (SFR_PWM_DEBUG) Core x sends the debug signal to PWM. Refer to "Debug Mode" in the section "Pulse Width Modulation Controller (PWM)" for details on configuring an action when the debug signal is active.  */
#define SFR_PWM_DEBUG_CORE1_NOT_SENT          (SFR_PWM_DEBUG_CORE1_NOT_SENT_Val << SFR_PWM_DEBUG_CORE1_Pos) /* (SFR_PWM_DEBUG) Core x does not send the debug signal to the PWM. Position  */
#define SFR_PWM_DEBUG_CORE1_SENT              (SFR_PWM_DEBUG_CORE1_SENT_Val << SFR_PWM_DEBUG_CORE1_Pos) /* (SFR_PWM_DEBUG) Core x sends the debug signal to PWM. Refer to "Debug Mode" in the section "Pulse Width Modulation Controller (PWM)" for details on configuring an action when the debug signal is active. Position  */
#define SFR_PWM_DEBUG_Msk                     _UINT32_(0x00000003)                                 /* (SFR_PWM_DEBUG) Register Mask  */

#define SFR_PWM_DEBUG_CORE_Pos                _UINT32_(0)                                          /* (SFR_PWM_DEBUG Position) Debug Information Propagation Mode */
#define SFR_PWM_DEBUG_CORE_Msk                (_UINT32_(0x3) << SFR_PWM_DEBUG_CORE_Pos)            /* (SFR_PWM_DEBUG Mask) CORE */
#define SFR_PWM_DEBUG_CORE(value)             (SFR_PWM_DEBUG_CORE_Msk & (_UINT32_(value) << SFR_PWM_DEBUG_CORE_Pos)) 

/* -------- SFR_WAIT_MODE : (SFR Offset: 0xBC) (R/W 32) Improved Wait Mode Register -------- */
#define SFR_WAIT_MODE_CONTROL_Pos             _UINT32_(0)                                          /* (SFR_WAIT_MODE) Improved Wait Mode Control Position */
#define SFR_WAIT_MODE_CONTROL_Msk             (_UINT32_(0x1) << SFR_WAIT_MODE_CONTROL_Pos)         /* (SFR_WAIT_MODE) Improved Wait Mode Control Mask */
#define SFR_WAIT_MODE_CONTROL(value)          (SFR_WAIT_MODE_CONTROL_Msk & (_UINT32_(value) << SFR_WAIT_MODE_CONTROL_Pos)) /* Assigment of value for CONTROL in the SFR_WAIT_MODE register */
#define SFR_WAIT_MODE_Msk                     _UINT32_(0x00000001)                                 /* (SFR_WAIT_MODE) Register Mask  */


/* -------- SFR_WPMR : (SFR Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define SFR_WPMR_WPEN_Pos                     _UINT32_(0)                                          /* (SFR_WPMR) Write Protection Enable Position */
#define SFR_WPMR_WPEN_Msk                     (_UINT32_(0x1) << SFR_WPMR_WPEN_Pos)                 /* (SFR_WPMR) Write Protection Enable Mask */
#define SFR_WPMR_WPEN(value)                  (SFR_WPMR_WPEN_Msk & (_UINT32_(value) << SFR_WPMR_WPEN_Pos)) /* Assigment of value for WPEN in the SFR_WPMR register */
#define SFR_WPMR_WPKEY_Pos                    _UINT32_(8)                                          /* (SFR_WPMR) Write Protection Key Position */
#define SFR_WPMR_WPKEY_Msk                    (_UINT32_(0xFFFFFF) << SFR_WPMR_WPKEY_Pos)           /* (SFR_WPMR) Write Protection Key Mask */
#define SFR_WPMR_WPKEY(value)                 (SFR_WPMR_WPKEY_Msk & (_UINT32_(value) << SFR_WPMR_WPKEY_Pos)) /* Assigment of value for WPKEY in the SFR_WPMR register */
#define   SFR_WPMR_WPKEY_PASSWD_Val           _UINT32_(0x534652)                                   /* (SFR_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0.  */
#define SFR_WPMR_WPKEY_PASSWD                 (SFR_WPMR_WPKEY_PASSWD_Val << SFR_WPMR_WPKEY_Pos)    /* (SFR_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0. Position  */
#define SFR_WPMR_Msk                          _UINT32_(0xFFFFFF01)                                 /* (SFR_WPMR) Register Mask  */


