Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_fail_safe_bootloader/bootloader/firmware/src/packs/PIC32CX2051MTSH128_DFP/component/sfr.h
/* -------- SFR_WPSR : (SFR Offset: 0xE8) (R/W 32) Write Protection Status Register -------- */
#define SFR_WPSR_WPVS_Pos                     _UINT32_(0)                                          /* (SFR_WPSR) Write Protection Violation Status Position */
#define SFR_WPSR_WPVS_Msk                     (_UINT32_(0x1) << SFR_WPSR_WPVS_Pos)                 /* (SFR_WPSR) Write Protection Violation Status Mask */
#define SFR_WPSR_WPVS(value)                  (SFR_WPSR_WPVS_Msk & (_UINT32_(value) << SFR_WPSR_WPVS_Pos)) /* Assigment of value for WPVS in the SFR_WPSR register */
#define SFR_WPSR_WPSRC_Pos                    _UINT32_(8)                                          /* (SFR_WPSR) Write Protection Source Position */
#define SFR_WPSR_WPSRC_Msk                    (_UINT32_(0xFFFF) << SFR_WPSR_WPSRC_Pos)             /* (SFR_WPSR) Write Protection Source Mask */
#define SFR_WPSR_WPSRC(value)                 (SFR_WPSR_WPSRC_Msk & (_UINT32_(value) << SFR_WPSR_WPSRC_Pos)) /* Assigment of value for WPSRC in the SFR_WPSR register */
#define SFR_WPSR_Msk                          _UINT32_(0x00FFFF01)                                 /* (SFR_WPSR) Register Mask  */


/** \brief SFR register offsets definitions */
#define SFR_SRAM0_SW_CFG_REG_OFST      _UINT32_(0x10)      /* (SFR_SRAM0_SW_CFG) SRAM0 Software Config Register Offset */
#define SFR_FLASH_REG_OFST             _UINT32_(0x70)      /* (SFR_FLASH) Flash Memory Configuration Register Offset */
#define SFR_OPT_LINK_REG_OFST          _UINT32_(0x80)      /* (SFR_OPT_LINK) Optical Link Register Offset */
#define SFR_CORE_DEBUG_CFG_REG_OFST    _UINT32_(0xA0)      /* (SFR_CORE_DEBUG_CFG) Core Debug Configuration Register Offset */
#define SFR_ERASE_FLASH_SRAM_REG_OFST  _UINT32_(0xB0)      /* (SFR_ERASE_FLASH_SRAM) Erase Flash/SRAM Register Offset */
#define SFR_PWM_DEBUG_REG_OFST         _UINT32_(0xB4)      /* (SFR_PWM_DEBUG) PWM Debug Register Offset */
#define SFR_WAIT_MODE_REG_OFST         _UINT32_(0xBC)      /* (SFR_WAIT_MODE) Improved Wait Mode Register Offset */
#define SFR_WPMR_REG_OFST              _UINT32_(0xE4)      /* (SFR_WPMR) Write Protection Mode Register Offset */
#define SFR_WPSR_REG_OFST              _UINT32_(0xE8)      /* (SFR_WPSR) Write Protection Status Register Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief SFR register API structure */
typedef struct
{
  __I   uint8_t                        Reserved1[0x10];
  __IO  uint32_t                       SFR_SRAM0_SW_CFG;   /**< Offset: 0x10 (R/W  32) SRAM0 Software Config Register */
  __I   uint8_t                        Reserved2[0x5C];
  __IO  uint32_t                       SFR_FLASH;          /**< Offset: 0x70 (R/W  32) Flash Memory Configuration Register */
  __I   uint8_t                        Reserved3[0x0C];
  __IO  uint32_t                       SFR_OPT_LINK;       /**< Offset: 0x80 (R/W  32) Optical Link Register */
  __I   uint8_t                        Reserved4[0x1C];
  __IO  uint32_t                       SFR_CORE_DEBUG_CFG; /**< Offset: 0xA0 (R/W  32) Core Debug Configuration Register */
  __I   uint8_t                        Reserved5[0x0C];
  __IO  uint32_t                       SFR_ERASE_FLASH_SRAM; /**< Offset: 0xB0 (R/W  32) Erase Flash/SRAM Register */
  __IO  uint32_t                       SFR_PWM_DEBUG;      /**< Offset: 0xB4 (R/W  32) PWM Debug Register */
  __I   uint8_t                        Reserved6[0x04];
  __IO  uint32_t                       SFR_WAIT_MODE;      /**< Offset: 0xBC (R/W  32) Improved Wait Mode Register */
  __I   uint8_t                        Reserved7[0x24];
  __IO  uint32_t                       SFR_WPMR;           /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
  __IO  uint32_t                       SFR_WPSR;           /**< Offset: 0xE8 (R/W  32) Write Protection Status Register */
} sfr_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CXMTSH_SFR_COMPONENT_H_ */
